w7d5/reddit_clone/app/controllers/application_controller.rb

    def is_moderator?
        current_user == User.find(@sub.moderator_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]