w7d5/reddit_clone/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE (will) LIMIT $1  [["LIMIT", 1]]
---
    def create
        @user = User.find_by(params[:user][:username], params[:user][:password])