w7d5/reddit_clone/app/controllers/subs_controller.rb

    def show
        @sub = Sub.find(params[:id])
        @posts = Post.all.where(sub_id: params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 1]]